Revit 2024 API
ModificationForbiddenException Class
The exception that is thrown by the undo transaction framework when a modification operation is not allowed.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class ModificationForbiddenException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class ModificationForbiddenException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class ModificationForbiddenException : public InvalidOperationException
Remarks
 See also: [!:Autodesk::Revit::DB::Element::IsModifiable] and [!:Autodesk::Revit::DB::Document::IsModifiable].
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.ModificationForbiddenException
See Also
ModificationForbiddenException Members
Autodesk.Revit.Exceptions Namespace